library(dplyr)

bomber = readODS::read_ods('~/Documents/klsh/2024_fmt/fmt_2024_results.ods', sheet=2)

unique(bomber$who) %>% dput()

bomber_summary = group_by(bomber, team, who) %>% 
  summarise(points = sum(point)) %>% arrange(-points)

head(bomber_summary, n=9)



un = c("Камиль Гайнутдинов", "Михаил Любушкин", 
       "Степан Берсенев", "Настя Челышкина", 
       "Полина Перелешина", "Дима Коренько", 
       "Алиса Силаева", "Катя Малинина", "Настя Турцева", 
       "Маша Казаринова", "Андрей Агапов", 
       "Алексей Ковалев", "Александра Таюрская", 
       "Ксения Новикова", "Снежана Россиева", 
       "Анна Бояндина", "Валерия Холодкова", 
       "Андрей Нефедьев", "Даниил Кондрашов", 
       "Глеб Весельский", "Савва Ильющенков", 
       "Максим Трегубович", "Вова Носков", 
       "Илья Солнцев", "Максим Мухаметов", 
       "Маша Еремеева", "Арина Беккер", "Амелия Шелованова", 
       "Ольга Рябинина", "Вероника Шеховцева", 
       "Никита Боков", "Леонид Расторгуев", 
       "Аня Проценко", "Вика Наговицина", "Руслан Баяндин", 
       "Юрий Колесников", "Илья Иванков", "Фёдор Юдин", 
       "Матвей Семашко", "Анфиса Кашкина", 
       "Аня Степанова", "Вика Петрова", "Таня Якименко", 
       "Влад Рогов", "Андрей Кузяков", NA, "Люба Тимофеева", 
       "Полина Попова", "Даниил Иваныч", "Лев Олехнович", 
       "Макар Никитин", "Георгий Лысенко", 
       "Тима Бурмистров", "Вика Грозина", "Соня Аршукова", 
       "Соня Лосинская", "Антон Долиденок", 
       "Антон Поддубецкий", "Лев Назаров", 
       "Александра Макарова", "Даша Серостанова", 
       "Евгений Устинов", "Тимур Базарин", 
       "Иван Данилюк", "Вова Замбржицкий", 
       "Семён Гохфельд", "Катя Иванова", "Маша Полина", 
       "Лера Холодкова", "Данил Шатохин", "Леонид Титов", 
       "Михаил Машуков", "Иван Капля", "Виктор Гуляев", 
       "Настя Крикунова", "Анна Тихомирова", 
       "Ира Маслова", "Анна Щербакова", "Егор Костюнин", 
       "Василиса Копеева", "Елена Брюханова", 
       "Екатерина Тарлюк", "Варвара Чумакова"
)
